# Base/system
base-devel
gcc
git
networkmanager
tuned

# Audio
pipewire
pipewire-pulse
wireplumber
reaper

# Hyprland (Wayland)
hypridle
hyprland
hyprlock
hyprpaper
hyprpolkitagent
qt5-wayland
qt6-wayland
waybar
xdg-desktop-portal-hyprland
grim
slurp
swappy
python-pywal

# Terminal
kitty
zsh

# Apps
dunst
rofi-wayland
thunar
wl-clipboard
zathura
zed
kdeconnect

# CLI tools
brightnessctl
fzf
github-cli
imagemagick
tree
typst
zoxide
tldr

# Editors
neovim

# Development
godot
blender

# Fonts
noto-fonts
noto-fonts-emoji
ttf-jetbrains-mono-nerd
